**EJERCICIOS** 

1️⃣ Usando el diccionacrio dado Cread un *dataframe*.

  ```python

    diccionario = {"Nombre": ["Alejandro", "Anne", "Ana"], 
              "Apellidos": ["Sanz", "Krus", "García" ], 
              "Edad": [29, 30, 33], 
              "Provincia": ["Valencia", "Madrid", "Madrid"], 
              "Estudios": ["Físico", "Ingeniera", "Biologa"]}
  ```
    
    
2️⃣ Cread un *array* de NumPy con numeros aleatorios del 1 al 100 de dos dimensiones de 3 filas y 5 columnas (necesitaremos recordad conceptos adquiridos en la lección de NumPy 1). Los nombres de las columnas deben ser los dias de la semana de Lunes a Viernes. 


3️⃣ Empecemos a trabajar con `loc`e `iloc`. Usando el primer dataframe: 

   - Extrae todos los nombres de nuestro dataframe. 
   
   
   - ¿Cuántos años tiene Alejandro?
   
   
   - Extrae toda la información de las dos primeras columnas
   
   
   - ¿Quién tiene más de 30 años? Devolved solo el nombre. 
   
   
   - ¿Quién es de Madrid y tienen 30 años?
   
   
   - ¿Quién es Ingeniera o tiene menos de 30 años?
   

4️⃣ Momento de crear nuevas columnas: 

   - Cread una nueva columna a la que le sumeis 4 a todas las edades
   
   - Imaginemos ahora que Alejandro tiene 2 hermanos, Anne 1 y Ana 3. Insertad una nueva columna en la última posición con el número de hermanos de cada uno. 

   - Insertar una nueva columna donde tengamos el nombre y apellidos juntos. 
   
       **NOTA** De la misma forma que sumamos columnas numéricas podemos sumar columnas con strings

In [8]:
import pandas as pd
import numpy as np

In [12]:
# 1️⃣ Usando un diccionario creado por vosotras donde incluyais: 

diccionario = {"Nombre": ["Alejandro", "Anne", "Ana"], 
              "Apellidos": ["Sanz", "Krus", "García" ], 
              "Edad": [29, 30, 33], 
              "Provincia": ["Valencia", "Madrid", "Madrid"], 
              "Estudios": ["Físico", "Ingeniera", "Biologa"]}


df1 = pd.DataFrame(diccionario)
df1

      Nombre Apellidos  Edad Provincia   Estudios
0  Alejandro      Sanz    29  Valencia     Físico
1       Anne      Krus    30    Madrid  Ingeniera
2        Ana    García    33    Madrid    Biologa

In [14]:
# 2️⃣ Cread un *array* de NumPy con numeros aleatorios del 1 al 100 de tres dimensiones 

array = np.random.randint(0,100, (3,5))
array

array([[23, 13, 62, 62, 32],
       [66, 10, 80, 66,  3],
       [45,  9, 54, 23, 82]])

In [17]:
df2 = pd.DataFrame(array, columns = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes"])
df2

   Lunes  Martes  Miercoles  Jueves  Viernes
0     23      13         62      62       32
1     66      10         80      66        3
2     45       9         54      23       82

In [18]:
# 3️⃣ Extrae todos los nombres de nuestro dataframe. 
df1.loc[:, "Nombre"]

0    Alejandro
1         Anne
2          Ana
Name: Nombre, dtype: object

In [20]:
# 3️⃣¿Cuántos años tiene Alejandro? 

df.loc[0, "Edad"]

29

In [24]:
# 3️⃣ Extrae toda la información de las dos primeras columnas
df.iloc[:, :2]

      Nombre Apellidos
0  Alejandro      Sanz
1       Anne      Krus
2        Ana    García

In [29]:
# 3️⃣ ¿Quién tiene más de 30 años? Devolved solo el nombre. 

df[df["Edad"] > 30].loc[:, "Nombre"]

2    Ana
Name: Nombre, dtype: object

In [32]:
# 3️⃣ Quién es de Madrid y tienen 30 años?

df[(df["Edad"] == 30) & (df["Provincia"] == "Madrid")].loc[:, "Nombre"]

1    Anne
Name: Nombre, dtype: object

In [33]:
# 3️⃣ ¿Quién es Ingeniera o tiene menos de 30 años?

df[(df["Edad"] < 30) | (df["Estudios"] == "Ingeniera")].loc[:, "Nombre"]

0    Alejandro
1         Anne
Name: Nombre, dtype: object

In [35]:
# 4️⃣ Cread una nueva columna a la que le sumeis 4 a todas las edades

df["nueva_edad"] = df["Edad"] + 4
df

      Nombre Apellidos  Edad Provincia   Estudios  nueva_edad
0  Alejandro      Sanz    29  Valencia     Físico          33
1       Anne      Krus    30    Madrid  Ingeniera          34
2        Ana    García    33    Madrid    Biologa          37

In [36]:
# 4️⃣ Insertad una nueva columna en la última posición con el número de hermanos de cada uno. 

df.insert(6, "Hermanos", [2,1,3])

In [37]:
df

      Nombre Apellidos  Edad Provincia   Estudios  nueva_edad  Hermanos
0  Alejandro      Sanz    29  Valencia     Físico          33         2
1       Anne      Krus    30    Madrid  Ingeniera          34         1
2        Ana    García    33    Madrid    Biologa          37         3

In [38]:
df["Nombre_completo"] = df["Nombre"] + " " + df["Apellidos"]

In [39]:
df

,Nombre,Apellidos,Edad,Provincia,Estudios,nueva_edad,Hermanos,Nombre_completo
0,Alejandro,Sanz,29,Valencia,Físico,33,2,Alejandro Sanz
1,Anne,Krus,30,Madrid,Ingeniera,34,1,Anne Krus
2,Ana,García,33,Madrid,Biologa,37,3,Ana García